"""
Задача 30:  Заполните массив элементами арифметической прогрессии. Её первый элемент, разность и количество элементов нужно ввести с клавиатуры. Формула для получения n-го члена прогрессии: an = a1 + (n-1) * d.
Каждое число вводится с новой строки.
Ввод: 7 2 5
Вывод: 7 9 11 13 15
"""
# n = int(input('Введите длину: '))
# a = int(input('Введите первое число: '))
# d = int(input('Введите шаг: '))
# list1 = []
# for i in range(1,n+1):
#     x = a + (i-1) * d
#     list1.append(x)
#     i = i + 1
# print(list1)

"""
Задача 32: Определить элементs массива (списка), значения которых принадлежат заданному диапазону (т.е. не меньше заданного минимума и не больше заданного максимума)
Ввод: [-5, 9, 0, 3, -1, -2, 1, 4, -2, 10, 2, 0, -9, 8, 10, -9, 0, -5, -5, 7]
1
19
Вывод: [1, 9, 13, 14, 19]
"""
# min1 = int(input('Введите минимальное число: '))
# max1 = int(input('Введите максимальное число: '))
# list1 = [-5, 9, 0, 3, -1, -2, 1, 4, -2, 10, 2, 0, -9, 8, 10, -9, 0, -5, -5, 7]
# list2 = []
# for i in range(len(list1)):
#     if min1 <= list1[i] <= max1:
#         list2.append(list1[i])
# print(sorted(list2))
